# Mod13 Handling Missing Data

In [37]:
import numpy as np
import pandas as pd

In [17]:
np.__version__

'1.19.1'

In [18]:
pd.__version__

'1.1.0'

### Detecting null values

In [38]:
# None can only exist in 'object' array
d1 = pd.Series([1,'hello', None]); d1

0        1
1    hello
2     None
dtype: object

In [39]:
# None can only exist in 'object' array
d2 = pd.Series([1, None]); d2

0    1.0
1    NaN
dtype: float64

In [40]:
# None can only exist in 'object' array
data = pd.Series([1, np.nan, 'hello', None])   
data                                     # 因為有hello, 所以無法把None轉成NaN

0        1
1      NaN
2    hello
3     None
dtype: object

In [22]:
# np 有定義NaN, pd沒有, 但pd建在np 上

In [41]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [42]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [46]:
# Masking 
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [44]:
# Masking 
data[data.notnull()]

0        1
2    hello
dtype: object

In [45]:
# None can be convert to NaN
d2 = pd.Series([1, np.nan, 33, None])
d2

0     1.0
1     NaN
2    33.0
3     NaN
dtype: float64

In [28]:
%timeit d2.isnull().any()

97.2 µs ± 16.1 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [29]:
d2.isnull().any()  #any()如果找到一個為真, 就傳回True

True

In [47]:
%timeit d2.isnull().values.any()

63.7 µs ± 20.9 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [48]:
d2.isnull().values.any()

True

In [32]:
np.isnan(d2.values).any()

True

In [33]:
%timeit np.isnan(d2.values).any()     #所有方式中最快, 只能用在數字上, 文字無效

2.86 µs ± 392 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [49]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [50]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [61]:
planets.loc[0:]

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [62]:
planets.isnull()

      method  number  orbital_period   mass  distance   year
0      False   False           False  False     False  False
1      False   False           False  False     False  False
2      False   False           False  False     False  False
3      False   False           False  False     False  False
4      False   False           False  False     False  False
...      ...     ...             ...    ...       ...    ...
1030   False   False           False   True     False  False
1031   False   False           False   True     False  False
1032   False   False           False   True     False  False
1033   False   False           False   True     False  False
1034   False   False           False   True     False  False

[1035 rows x 6 columns]

In [63]:
planets.isnull().any()

method            False
number            False
orbital_period     True
mass               True
distance           True
year              False
dtype: bool

In [55]:
planets.isnull().any().any()

True

In [56]:
%timeit planets.isnull().any().any()

465 µs ± 17.1 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [64]:
np.isnan(planets.loc[1:].any().any())

False

In [ ]:
%timeit planets.isnull().values.any()

In [68]:
planets.iloc[:,1:].values

array([[1.0000000e+00, 2.6930000e+02, 7.1000000e+00, 7.7400000e+01,
        2.0060000e+03],
       [1.0000000e+00, 8.7477400e+02, 2.2100000e+00, 5.6950000e+01,
        2.0080000e+03],
       [1.0000000e+00, 7.6300000e+02, 2.6000000e+00, 1.9840000e+01,
        2.0110000e+03],
       ...,
       [1.0000000e+00, 3.1915239e+00,           nan, 1.7400000e+02,
        2.0070000e+03],
       [1.0000000e+00, 4.1250828e+00,           nan, 2.9300000e+02,
        2.0080000e+03],
       [1.0000000e+00, 4.1877570e+00,           nan, 2.6000000e+02,
        2.0080000e+03]])

In [72]:
planets[np.isnan(planets.iloc[:,1:].values)]

               method  number  orbital_period  mass  distance  year
7     Radial Velocity       1      798.500000   NaN     21.41  1996
20    Radial Velocity       5        0.736540   NaN     12.53  2011
25    Radial Velocity       1      116.688400   NaN     18.11  1996
26    Radial Velocity       1      691.900000   NaN     81.50  2012
29            Imaging       1             NaN   NaN     45.52  2005
...               ...     ...             ...   ...       ...   ...
1030          Transit       1        3.941507   NaN    172.00  2006
1031          Transit       1        2.615864   NaN    148.00  2007
1032          Transit       1        3.191524   NaN    174.00  2007
1033          Transit       1        4.125083   NaN    293.00  2008
1034          Transit       1        4.187757   NaN    260.00  2008

[792 rows x 6 columns]

In [69]:
np.isnan(planets.iloc[:,1:].values).any()

True

In [ ]:
%timeit np.isnan(planets.iloc[:,1:].values).any()

In [ ]:
np.isnan(planets.values)     #因為有文字所以無法以此查詢

In [73]:
planets.values

array([['Radial Velocity', 1, 269.3, 7.1, 77.4, 2006],
       ['Radial Velocity', 1, 874.7739999999999, 2.21, 56.95, 2008],
       ['Radial Velocity', 1, 763.0, 2.6, 19.84, 2011],
       ...,
       ['Transit', 1, 3.1915239, nan, 174.0, 2007],
       ['Transit', 1, 4.1250828, nan, 293.0, 2008],
       ['Transit', 1, 4.187757, nan, 260.0, 2008]], dtype=object)

### Dropping null values

For a ``Series``

In [74]:
planets['mass']

0        7.10
1        2.21
2        2.60
3       19.40
4       10.50
        ...
1030      NaN
1031      NaN
1032      NaN
1033      NaN
1034      NaN
Name: mass, Length: 1035, dtype: float64

In [81]:
planets['mass'].notnull()

0        True
1        True
2        True
3        True
4        True
        ...
1030    False
1031    False
1032    False
1033    False
1034    False
Name: mass, Length: 1035, dtype: bool

In [77]:
planets['mass'][planets['mass'].notnull()]  # mask method 方式

0       7.100
1       2.210
2       2.600
3      19.400
4      10.500
        ...
784     0.947
913    19.800
914     0.340
915     0.400
916     1.540
Name: mass, Length: 513, dtype: float64

In [78]:
%timeit planets['mass'][planets['mass'].notnull()]

183 µs ± 27.6 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [82]:
planets.dropna()

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [83]:
data.dropna()

0        1
2    hello
dtype: object

For a ``DataFrame``

In [197]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

By default, ``dropna()`` will drop all rows in which *any* null value is present:

In [85]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [86]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [87]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [88]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [201]:
df.dropna(axis='rows', thresh=0)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

### Filling null values

#### For ``Series``

Masking style

In [92]:
d1 = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
d1

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [93]:
d1.isnull()

a    False
b     True
c    False
d     True
e    False
dtype: bool

In [94]:
d1[d1.isnull()]=0
d1

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

fill NA entries with a single value, such as zero:

In [95]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [96]:
# fill with zero
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [97]:
# fill with mean
data.fillna(data.mean())

a    1.0
b    2.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [98]:
# fill with median
data.fillna(data.median())

a    1.0
b    2.0
c    2.0
d    2.0
e    3.0
dtype: float64

specify a forward-fill to propagate the previous value forward:

In [99]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [100]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [102]:
# data.fillna()

#### For ``DataFrame``

In [103]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [104]:
df.iloc[1]

0    2.0
1    3.0
2    5.0
3    NaN
Name: 1, dtype: float64

In [105]:
type(df.iloc[1])

pandas.core.series.Series

In [106]:
df.fillna(method='ffill', axis=1)      # forward-fill 補前一個值

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [107]:
planets['mass'][planets['mass'].notnull()]

0       7.100
1       2.210
2       2.600
3      19.400
4      10.500
        ...
784     0.947
913    19.800
914     0.340
915     0.400
916     1.540
Name: mass, Length: 513, dtype: float64

In [108]:
df.fillna(method='ffill')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

## Lab

<b>有一個 DataFrame df，試著計算空值個數有幾個?</b>

In [203]:
arr = np.array([[ 8.,  2., 17., 20., 10.],
       [ 4., np.nan,  3., np.nan,  2.],
       [24., 26., 14., 23., 21.],
       [ 7., 29.,  3., 19., 25.],
       [14., 24., np.nan, 21., 10.],
       [np.nan, np.nan, 20., 26., np.nan]])

df = pd.DataFrame(arr, columns=['one', 'two', 'three', 'four', 'five'])
df

    one   two  three  four  five
0   8.0   2.0   17.0  20.0  10.0
1   4.0   NaN    3.0   NaN   2.0
2  24.0  26.0   14.0  23.0  21.0
3   7.0  29.0    3.0  19.0  25.0
4  14.0  24.0    NaN  21.0  10.0
5   NaN   NaN   20.0  26.0   NaN

In [187]:
df.values

array([[ 8.,  2., 17., 20., 10.],
       [ 4., nan,  3., nan,  2.],
       [24., 26., 14., 23., 21.],
       [ 7., 29.,  3., 19., 25.],
       [14., 24., nan, 21., 10.],
       [nan, nan, 20., 26., nan]])

In [188]:
df.isnull().sum()

one      1
two      2
three    1
four     1
five     1
dtype: int64

<b>試著將有空值的列拋棄</b>

In [189]:
df.dropna()

    one   two  three  four  five
0   8.0   2.0   17.0  20.0  10.0
2  24.0  26.0   14.0  23.0  21.0
3   7.0  29.0    3.0  19.0  25.0

<b>試著將空值超過一個以上的列拋棄</b>

In [205]:
df.dropna(axis='rows', thresh=1)

    one   two  three  four  five
0   8.0   2.0   17.0  20.0  10.0
1   4.0   NaN    3.0   NaN   2.0
2  24.0  26.0   14.0  23.0  21.0
3   7.0  29.0    3.0  19.0  25.0
4  14.0  24.0    NaN  21.0  10.0
5   NaN   NaN   20.0  26.0   NaN